package ru.dust.self

object Const {
  // ивммт

  val RUS_CHAR_HZ: Map[Int, Char] = Map(
    1 ->'о', // --
    2 ->'е', // - Плеер
    3 ->'а', // -
    4 ->'и', // -
    5 ->'н', // - тонна
    6 ->'т', // -
    7 ->'с', //  Лассо Месса Шасси Шоссе !
    8 ->'р', // -
    9 ->'в', // -
    10->'л', // билль Вилла Галлы Колли Ралли
    11->'к', // мекка
    12->'м', //  гемма Лемма Сумма !
    13->'д', // - Будда !
    14->'п', // -
    15->'у', // -
    16->'я', // -
    17->'ы', // -
    18->'ь', // -
    19->'г', // -
    20->'з', // -
    21->'б', // Лобби Хобби !
    22->'ч', // -
    23->'й', // -
    24->'х', // -
    25->'ж', // Вожжа Вожжи !
    26->'ш', // -
    27->'ю', // -
    28->'ц', // пицца !
    29->'щ', // -
    30->'э', // -
    31->'ф', // -
    32->'ъ', // -
    33->'ё', // --
    40 -> ' ',
    100-> '*',
    101 -> ',',
    102 -> '.',
    103 -> '!',
    104 -> '?',
    105 -> '-'
  )

}
